# CanManipulateSubElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..CanManipulateSubElement Method
Form Class See Also
---
Tell if a sub element can be deleted/moved/rotated/scaled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CanManipulateSubElement(
	Reference subElementReference
)
```

Visual Basic
---
```text
Public Function CanManipulateSubElement ( _
	subElementReference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
bool CanManipulateSubElement(
	Reference^ subElementReference
)
```

# ### Parameters
subElementReference
    Type: Autodesk.Revit.DB..::..ReferenceThe geometry reference of face/edge/curve/vertex
# See Also
Form Class
Autodesk.Revit.DB Namespace